GopalSaraf/Practicals/PSDL/include/proc/pic18f87k90.inc
// Register: CCP7CON
#define CCP7CON CCP7CON
CCP7CON                                  equ 0F06h
// bitfield definitions
CCP7CON_CCP7M_POSN                       equ 0000h
CCP7CON_CCP7M_POSITION                   equ 0000h
CCP7CON_CCP7M_SIZE                       equ 0004h
CCP7CON_CCP7M_LENGTH                     equ 0004h
CCP7CON_CCP7M_MASK                       equ 000Fh
CCP7CON_DC7B_POSN                        equ 0004h
CCP7CON_DC7B_POSITION                    equ 0004h
CCP7CON_DC7B_SIZE                        equ 0002h
CCP7CON_DC7B_LENGTH                      equ 0002h
CCP7CON_DC7B_MASK                        equ 0030h
CCP7CON_CCP7M0_POSN                      equ 0000h
CCP7CON_CCP7M0_POSITION                  equ 0000h
CCP7CON_CCP7M0_SIZE                      equ 0001h
CCP7CON_CCP7M0_LENGTH                    equ 0001h
CCP7CON_CCP7M0_MASK                      equ 0001h
CCP7CON_CCP7M1_POSN                      equ 0001h
CCP7CON_CCP7M1_POSITION                  equ 0001h
CCP7CON_CCP7M1_SIZE                      equ 0001h
CCP7CON_CCP7M1_LENGTH                    equ 0001h
CCP7CON_CCP7M1_MASK                      equ 0002h
CCP7CON_CCP7M2_POSN                      equ 0002h
CCP7CON_CCP7M2_POSITION                  equ 0002h
CCP7CON_CCP7M2_SIZE                      equ 0001h
CCP7CON_CCP7M2_LENGTH                    equ 0001h
CCP7CON_CCP7M2_MASK                      equ 0004h
CCP7CON_CCP7M3_POSN                      equ 0003h
CCP7CON_CCP7M3_POSITION                  equ 0003h
CCP7CON_CCP7M3_SIZE                      equ 0001h
CCP7CON_CCP7M3_LENGTH                    equ 0001h
CCP7CON_CCP7M3_MASK                      equ 0008h
CCP7CON_DC7B0_POSN                       equ 0004h
CCP7CON_DC7B0_POSITION                   equ 0004h
CCP7CON_DC7B0_SIZE                       equ 0001h
CCP7CON_DC7B0_LENGTH                     equ 0001h
CCP7CON_DC7B0_MASK                       equ 0010h
CCP7CON_DC7B1_POSN                       equ 0005h
CCP7CON_DC7B1_POSITION                   equ 0005h
CCP7CON_DC7B1_SIZE                       equ 0001h
CCP7CON_DC7B1_LENGTH                     equ 0001h
CCP7CON_DC7B1_MASK                       equ 0020h
CCP7CON_CCP7Y_POSN                       equ 0004h
CCP7CON_CCP7Y_POSITION                   equ 0004h
CCP7CON_CCP7Y_SIZE                       equ 0001h
CCP7CON_CCP7Y_LENGTH                     equ 0001h
CCP7CON_CCP7Y_MASK                       equ 0010h
CCP7CON_CCP7X_POSN                       equ 0005h
CCP7CON_CCP7X_POSITION                   equ 0005h
CCP7CON_CCP7X_SIZE                       equ 0001h
CCP7CON_CCP7X_LENGTH                     equ 0001h
CCP7CON_CCP7X_MASK                       equ 0020h

// Register: CCPR7
#define CCPR7 CCPR7
CCPR7                                    equ 0F07h

// Register: CCPR7L
#define CCPR7L CCPR7L
CCPR7L                                   equ 0F07h
// bitfield definitions
CCPR7L_CCPR7L_POSN                       equ 0000h
CCPR7L_CCPR7L_POSITION                   equ 0000h
CCPR7L_CCPR7L_SIZE                       equ 0008h
CCPR7L_CCPR7L_LENGTH                     equ 0008h
CCPR7L_CCPR7L_MASK                       equ 00FFh

// Register: CCPR7H
#define CCPR7H CCPR7H
CCPR7H                                   equ 0F08h
// bitfield definitions
CCPR7H_CCPR7H_POSN                       equ 0000h
CCPR7H_CCPR7H_POSITION                   equ 0000h
CCPR7H_CCPR7H_SIZE                       equ 0008h
CCPR7H_CCPR7H_LENGTH                     equ 0008h
CCPR7H_CCPR7H_MASK                       equ 00FFh

// Register: CCP6CON
#define CCP6CON CCP6CON
CCP6CON                                  equ 0F09h
// bitfield definitions
CCP6CON_CCP6M_POSN                       equ 0000h
CCP6CON_CCP6M_POSITION                   equ 0000h
CCP6CON_CCP6M_SIZE                       equ 0004h
CCP6CON_CCP6M_LENGTH                     equ 0004h
CCP6CON_CCP6M_MASK                       equ 000Fh
CCP6CON_DC6B_POSN                        equ 0004h
CCP6CON_DC6B_POSITION                    equ 0004h
CCP6CON_DC6B_SIZE                        equ 0002h
CCP6CON_DC6B_LENGTH                      equ 0002h
CCP6CON_DC6B_MASK                        equ 0030h
CCP6CON_CCP6M0_POSN                      equ 0000h
CCP6CON_CCP6M0_POSITION                  equ 0000h
CCP6CON_CCP6M0_SIZE                      equ 0001h
CCP6CON_CCP6M0_LENGTH                    equ 0001h
CCP6CON_CCP6M0_MASK                      equ 0001h
CCP6CON_CCP6M1_POSN                      equ 0001h
CCP6CON_CCP6M1_POSITION                  equ 0001h
CCP6CON_CCP6M1_SIZE                      equ 0001h
CCP6CON_CCP6M1_LENGTH                    equ 0001h
CCP6CON_CCP6M1_MASK                      equ 0002h
CCP6CON_CCP6M2_POSN                      equ 0002h
CCP6CON_CCP6M2_POSITION                  equ 0002h
CCP6CON_CCP6M2_SIZE                      equ 0001h
CCP6CON_CCP6M2_LENGTH                    equ 0001h
CCP6CON_CCP6M2_MASK                      equ 0004h
CCP6CON_CCP6M3_POSN                      equ 0003h
CCP6CON_CCP6M3_POSITION                  equ 0003h
CCP6CON_CCP6M3_SIZE                      equ 0001h
CCP6CON_CCP6M3_LENGTH                    equ 0001h
CCP6CON_CCP6M3_MASK                      equ 0008h
CCP6CON_DC6B0_POSN                       equ 0004h
CCP6CON_DC6B0_POSITION                   equ 0004h
CCP6CON_DC6B0_SIZE                       equ 0001h
CCP6CON_DC6B0_LENGTH                     equ 0001h
CCP6CON_DC6B0_MASK                       equ 0010h
CCP6CON_DC6B1_POSN                       equ 0005h
CCP6CON_DC6B1_POSITION                   equ 0005h
CCP6CON_DC6B1_SIZE                       equ 0001h
CCP6CON_DC6B1_LENGTH                     equ 0001h
CCP6CON_DC6B1_MASK                       equ 0020h
CCP6CON_CCP6Y_POSN                       equ 0004h
CCP6CON_CCP6Y_POSITION                   equ 0004h
CCP6CON_CCP6Y_SIZE                       equ 0001h
CCP6CON_CCP6Y_LENGTH                     equ 0001h
CCP6CON_CCP6Y_MASK                       equ 0010h
CCP6CON_CCP6X_POSN                       equ 0005h
CCP6CON_CCP6X_POSITION                   equ 0005h
CCP6CON_CCP6X_SIZE                       equ 0001h
CCP6CON_CCP6X_LENGTH                     equ 0001h
CCP6CON_CCP6X_MASK                       equ 0020h

// Register: CCPR6
#define CCPR6 CCPR6
CCPR6                                    equ 0F0Ah

// Register: CCPR6L
#define CCPR6L CCPR6L
CCPR6L                                   equ 0F0Ah
// bitfield definitions
CCPR6L_CCPR6L_POSN                       equ 0000h
CCPR6L_CCPR6L_POSITION                   equ 0000h
CCPR6L_CCPR6L_SIZE                       equ 0008h
CCPR6L_CCPR6L_LENGTH                     equ 0008h
CCPR6L_CCPR6L_MASK                       equ 00FFh

