GopalSaraf/Practicals/PSDL/include/proc/pic18f87k90.inc
// Register: LCDDATA4
#define LCDDATA4 LCDDATA4
LCDDATA4                                 equ 0F6Ah
// bitfield definitions
LCDDATA4_S32C0_POSN                      equ 0000h
LCDDATA4_S32C0_POSITION                  equ 0000h
LCDDATA4_S32C0_SIZE                      equ 0001h
LCDDATA4_S32C0_LENGTH                    equ 0001h
LCDDATA4_S32C0_MASK                      equ 0001h
LCDDATA4_S33C0_POSN                      equ 0001h
LCDDATA4_S33C0_POSITION                  equ 0001h
LCDDATA4_S33C0_SIZE                      equ 0001h
LCDDATA4_S33C0_LENGTH                    equ 0001h
LCDDATA4_S33C0_MASK                      equ 0002h
LCDDATA4_S34C0_POSN                      equ 0002h
LCDDATA4_S34C0_POSITION                  equ 0002h
LCDDATA4_S34C0_SIZE                      equ 0001h
LCDDATA4_S34C0_LENGTH                    equ 0001h
LCDDATA4_S34C0_MASK                      equ 0004h
LCDDATA4_S35C0_POSN                      equ 0003h
LCDDATA4_S35C0_POSITION                  equ 0003h
LCDDATA4_S35C0_SIZE                      equ 0001h
LCDDATA4_S35C0_LENGTH                    equ 0001h
LCDDATA4_S35C0_MASK                      equ 0008h
LCDDATA4_S36C0_POSN                      equ 0004h
LCDDATA4_S36C0_POSITION                  equ 0004h
LCDDATA4_S36C0_SIZE                      equ 0001h
LCDDATA4_S36C0_LENGTH                    equ 0001h
LCDDATA4_S36C0_MASK                      equ 0010h
LCDDATA4_S37C0_POSN                      equ 0005h
LCDDATA4_S37C0_POSITION                  equ 0005h
LCDDATA4_S37C0_SIZE                      equ 0001h
LCDDATA4_S37C0_LENGTH                    equ 0001h
LCDDATA4_S37C0_MASK                      equ 0020h
LCDDATA4_S38C0_POSN                      equ 0006h
LCDDATA4_S38C0_POSITION                  equ 0006h
LCDDATA4_S38C0_SIZE                      equ 0001h
LCDDATA4_S38C0_LENGTH                    equ 0001h
LCDDATA4_S38C0_MASK                      equ 0040h
LCDDATA4_S39C0_POSN                      equ 0007h
LCDDATA4_S39C0_POSITION                  equ 0007h
LCDDATA4_S39C0_SIZE                      equ 0001h
LCDDATA4_S39C0_LENGTH                    equ 0001h
LCDDATA4_S39C0_MASK                      equ 0080h

// Register: LCDDATA5
#define LCDDATA5 LCDDATA5
LCDDATA5                                 equ 0F6Bh
// bitfield definitions
LCDDATA5_S40C0_POSN                      equ 0000h
LCDDATA5_S40C0_POSITION                  equ 0000h
LCDDATA5_S40C0_SIZE                      equ 0001h
LCDDATA5_S40C0_LENGTH                    equ 0001h
LCDDATA5_S40C0_MASK                      equ 0001h
LCDDATA5_S41C0_POSN                      equ 0001h
LCDDATA5_S41C0_POSITION                  equ 0001h
LCDDATA5_S41C0_SIZE                      equ 0001h
LCDDATA5_S41C0_LENGTH                    equ 0001h
LCDDATA5_S41C0_MASK                      equ 0002h
LCDDATA5_S42C0_POSN                      equ 0002h
LCDDATA5_S42C0_POSITION                  equ 0002h
LCDDATA5_S42C0_SIZE                      equ 0001h
LCDDATA5_S42C0_LENGTH                    equ 0001h
LCDDATA5_S42C0_MASK                      equ 0004h
LCDDATA5_S43C0_POSN                      equ 0003h
LCDDATA5_S43C0_POSITION                  equ 0003h
LCDDATA5_S43C0_SIZE                      equ 0001h
LCDDATA5_S43C0_LENGTH                    equ 0001h
LCDDATA5_S43C0_MASK                      equ 0008h
LCDDATA5_S44C0_POSN                      equ 0004h
LCDDATA5_S44C0_POSITION                  equ 0004h
LCDDATA5_S44C0_SIZE                      equ 0001h
LCDDATA5_S44C0_LENGTH                    equ 0001h
LCDDATA5_S44C0_MASK                      equ 0010h
LCDDATA5_S45C0_POSN                      equ 0005h
LCDDATA5_S45C0_POSITION                  equ 0005h
LCDDATA5_S45C0_SIZE                      equ 0001h
LCDDATA5_S45C0_LENGTH                    equ 0001h
LCDDATA5_S45C0_MASK                      equ 0020h
LCDDATA5_S46C0_POSN                      equ 0006h
LCDDATA5_S46C0_POSITION                  equ 0006h
LCDDATA5_S46C0_SIZE                      equ 0001h
LCDDATA5_S46C0_LENGTH                    equ 0001h
LCDDATA5_S46C0_MASK                      equ 0040h
LCDDATA5_S47C0_POSN                      equ 0007h
LCDDATA5_S47C0_POSITION                  equ 0007h
LCDDATA5_S47C0_SIZE                      equ 0001h
LCDDATA5_S47C0_LENGTH                    equ 0001h
LCDDATA5_S47C0_MASK                      equ 0080h
LCDDATA5_S40C15_POSN                     equ 0000h
LCDDATA5_S40C15_POSITION                 equ 0000h
LCDDATA5_S40C15_SIZE                     equ 0001h
LCDDATA5_S40C15_LENGTH                   equ 0001h
LCDDATA5_S40C15_MASK                     equ 0001h

// Register: LCDDATA6
#define LCDDATA6 LCDDATA6
LCDDATA6                                 equ 0F6Ch
// bitfield definitions
LCDDATA6_S00C1_POSN                      equ 0000h
LCDDATA6_S00C1_POSITION                  equ 0000h
LCDDATA6_S00C1_SIZE                      equ 0001h
LCDDATA6_S00C1_LENGTH                    equ 0001h
LCDDATA6_S00C1_MASK                      equ 0001h
LCDDATA6_S01C1_POSN                      equ 0001h
LCDDATA6_S01C1_POSITION                  equ 0001h
LCDDATA6_S01C1_SIZE                      equ 0001h
LCDDATA6_S01C1_LENGTH                    equ 0001h
LCDDATA6_S01C1_MASK                      equ 0002h
LCDDATA6_S02C1_POSN                      equ 0002h
LCDDATA6_S02C1_POSITION                  equ 0002h
LCDDATA6_S02C1_SIZE                      equ 0001h
LCDDATA6_S02C1_LENGTH                    equ 0001h
LCDDATA6_S02C1_MASK                      equ 0004h
LCDDATA6_S03C1_POSN                      equ 0003h
LCDDATA6_S03C1_POSITION                  equ 0003h
LCDDATA6_S03C1_SIZE                      equ 0001h
LCDDATA6_S03C1_LENGTH                    equ 0001h
LCDDATA6_S03C1_MASK                      equ 0008h
LCDDATA6_S04C1_POSN                      equ 0004h
LCDDATA6_S04C1_POSITION                  equ 0004h
LCDDATA6_S04C1_SIZE                      equ 0001h
LCDDATA6_S04C1_LENGTH                    equ 0001h
LCDDATA6_S04C1_MASK                      equ 0010h
LCDDATA6_S05C1_POSN                      equ 0005h
LCDDATA6_S05C1_POSITION                  equ 0005h
LCDDATA6_S05C1_SIZE                      equ 0001h
LCDDATA6_S05C1_LENGTH                    equ 0001h
LCDDATA6_S05C1_MASK                      equ 0020h
LCDDATA6_S06C1_POSN                      equ 0006h
LCDDATA6_S06C1_POSITION                  equ 0006h
LCDDATA6_S06C1_SIZE                      equ 0001h
LCDDATA6_S06C1_LENGTH                    equ 0001h
LCDDATA6_S06C1_MASK                      equ 0040h
LCDDATA6_S07C1_POSN                      equ 0007h
LCDDATA6_S07C1_POSITION                  equ 0007h
LCDDATA6_S07C1_SIZE                      equ 0001h
LCDDATA6_S07C1_LENGTH                    equ 0001h
LCDDATA6_S07C1_MASK                      equ 0080h

// Register: LCDDATA7
#define LCDDATA7 LCDDATA7
LCDDATA7                                 equ 0F6Dh
// bitfield definitions
LCDDATA7_S08C1_POSN                      equ 0000h
LCDDATA7_S08C1_POSITION                  equ 0000h
LCDDATA7_S08C1_SIZE                      equ 0001h
LCDDATA7_S08C1_LENGTH                    equ 0001h
LCDDATA7_S08C1_MASK                      equ 0001h
LCDDATA7_S09C1_POSN                      equ 0001h
LCDDATA7_S09C1_POSITION                  equ 0001h
LCDDATA7_S09C1_SIZE                      equ 0001h
LCDDATA7_S09C1_LENGTH                    equ 0001h
LCDDATA7_S09C1_MASK                      equ 0002h
LCDDATA7_S10C1_POSN                      equ 0002h
LCDDATA7_S10C1_POSITION                  equ 0002h
LCDDATA7_S10C1_SIZE                      equ 0001h
LCDDATA7_S10C1_LENGTH                    equ 0001h
LCDDATA7_S10C1_MASK                      equ 0004h
LCDDATA7_S11C1_POSN                      equ 0003h
LCDDATA7_S11C1_POSITION                  equ 0003h
LCDDATA7_S11C1_SIZE                      equ 0001h
LCDDATA7_S11C1_LENGTH                    equ 0001h
LCDDATA7_S11C1_MASK                      equ 0008h
LCDDATA7_S12C1_POSN                      equ 0004h
LCDDATA7_S12C1_POSITION                  equ 0004h
LCDDATA7_S12C1_SIZE                      equ 0001h
LCDDATA7_S12C1_LENGTH                    equ 0001h
LCDDATA7_S12C1_MASK                      equ 0010h
LCDDATA7_S13C1_POSN                      equ 0005h
LCDDATA7_S13C1_POSITION                  equ 0005h
LCDDATA7_S13C1_SIZE                      equ 0001h
LCDDATA7_S13C1_LENGTH                    equ 0001h
LCDDATA7_S13C1_MASK                      equ 0020h
LCDDATA7_S14C1_POSN                      equ 0006h
LCDDATA7_S14C1_POSITION                  equ 0006h
LCDDATA7_S14C1_SIZE                      equ 0001h
LCDDATA7_S14C1_LENGTH                    equ 0001h
LCDDATA7_S14C1_MASK                      equ 0040h
LCDDATA7_S15C1_POSN                      equ 0007h
LCDDATA7_S15C1_POSITION                  equ 0007h
LCDDATA7_S15C1_SIZE                      equ 0001h
LCDDATA7_S15C1_LENGTH                    equ 0001h
LCDDATA7_S15C1_MASK                      equ 0080h

// Register: LCDDATA8
#define LCDDATA8 LCDDATA8
LCDDATA8                                 equ 0F6Eh
// bitfield definitions
LCDDATA8_S16C1_POSN                      equ 0000h
LCDDATA8_S16C1_POSITION                  equ 0000h
LCDDATA8_S16C1_SIZE                      equ 0001h
LCDDATA8_S16C1_LENGTH                    equ 0001h
LCDDATA8_S16C1_MASK                      equ 0001h
LCDDATA8_S17C1_POSN                      equ 0001h
LCDDATA8_S17C1_POSITION                  equ 0001h
LCDDATA8_S17C1_SIZE                      equ 0001h
LCDDATA8_S17C1_LENGTH                    equ 0001h
LCDDATA8_S17C1_MASK                      equ 0002h
LCDDATA8_S18C1_POSN                      equ 0002h
LCDDATA8_S18C1_POSITION                  equ 0002h
LCDDATA8_S18C1_SIZE                      equ 0001h
LCDDATA8_S18C1_LENGTH                    equ 0001h
LCDDATA8_S18C1_MASK                      equ 0004h
LCDDATA8_S19C1_POSN                      equ 0003h
LCDDATA8_S19C1_POSITION                  equ 0003h
LCDDATA8_S19C1_SIZE                      equ 0001h
LCDDATA8_S19C1_LENGTH                    equ 0001h
LCDDATA8_S19C1_MASK                      equ 0008h
LCDDATA8_S20C1_POSN                      equ 0004h
LCDDATA8_S20C1_POSITION                  equ 0004h
LCDDATA8_S20C1_SIZE                      equ 0001h
LCDDATA8_S20C1_LENGTH                    equ 0001h
LCDDATA8_S20C1_MASK                      equ 0010h
LCDDATA8_S21C1_POSN                      equ 0005h
LCDDATA8_S21C1_POSITION                  equ 0005h
LCDDATA8_S21C1_SIZE                      equ 0001h
LCDDATA8_S21C1_LENGTH                    equ 0001h
LCDDATA8_S21C1_MASK                      equ 0020h
LCDDATA8_S22C1_POSN                      equ 0006h
LCDDATA8_S22C1_POSITION                  equ 0006h
LCDDATA8_S22C1_SIZE                      equ 0001h
LCDDATA8_S22C1_LENGTH                    equ 0001h
LCDDATA8_S22C1_MASK                      equ 0040h
LCDDATA8_S23C1_POSN                      equ 0007h
LCDDATA8_S23C1_POSITION                  equ 0007h
LCDDATA8_S23C1_SIZE                      equ 0001h
LCDDATA8_S23C1_LENGTH                    equ 0001h
LCDDATA8_S23C1_MASK                      equ 0080h

// Register: LCDDATA9
#define LCDDATA9 LCDDATA9
LCDDATA9                                 equ 0F6Fh
// bitfield definitions
LCDDATA9_S24C1_POSN                      equ 0000h
LCDDATA9_S24C1_POSITION                  equ 0000h
LCDDATA9_S24C1_SIZE                      equ 0001h
LCDDATA9_S24C1_LENGTH                    equ 0001h
LCDDATA9_S24C1_MASK                      equ 0001h
LCDDATA9_S25C1_POSN                      equ 0001h
LCDDATA9_S25C1_POSITION                  equ 0001h
LCDDATA9_S25C1_SIZE                      equ 0001h
LCDDATA9_S25C1_LENGTH                    equ 0001h
LCDDATA9_S25C1_MASK                      equ 0002h
LCDDATA9_S26C1_POSN                      equ 0002h
LCDDATA9_S26C1_POSITION                  equ 0002h
LCDDATA9_S26C1_SIZE                      equ 0001h
LCDDATA9_S26C1_LENGTH                    equ 0001h
LCDDATA9_S26C1_MASK                      equ 0004h
LCDDATA9_S27C1_POSN                      equ 0003h
LCDDATA9_S27C1_POSITION                  equ 0003h
LCDDATA9_S27C1_SIZE                      equ 0001h
LCDDATA9_S27C1_LENGTH                    equ 0001h
LCDDATA9_S27C1_MASK                      equ 0008h
LCDDATA9_S28C1_POSN                      equ 0004h
LCDDATA9_S28C1_POSITION                  equ 0004h
LCDDATA9_S28C1_SIZE                      equ 0001h
LCDDATA9_S28C1_LENGTH                    equ 0001h
LCDDATA9_S28C1_MASK                      equ 0010h
LCDDATA9_S29C1_POSN                      equ 0005h
LCDDATA9_S29C1_POSITION                  equ 0005h
LCDDATA9_S29C1_SIZE                      equ 0001h
LCDDATA9_S29C1_LENGTH                    equ 0001h
LCDDATA9_S29C1_MASK                      equ 0020h
LCDDATA9_S30C1_POSN                      equ 0006h
LCDDATA9_S30C1_POSITION                  equ 0006h
LCDDATA9_S30C1_SIZE                      equ 0001h
LCDDATA9_S30C1_LENGTH                    equ 0001h
LCDDATA9_S30C1_MASK                      equ 0040h
LCDDATA9_S31C1_POSN                      equ 0007h
LCDDATA9_S31C1_POSITION                  equ 0007h
LCDDATA9_S31C1_SIZE                      equ 0001h
LCDDATA9_S31C1_LENGTH                    equ 0001h
LCDDATA9_S31C1_MASK                      equ 0080h

// Register: LCDDATA10
#define LCDDATA10 LCDDATA10
LCDDATA10                                equ 0F70h
// bitfield definitions
LCDDATA10_S32C1_POSN                     equ 0000h
LCDDATA10_S32C1_POSITION                 equ 0000h
LCDDATA10_S32C1_SIZE                     equ 0001h
LCDDATA10_S32C1_LENGTH                   equ 0001h
LCDDATA10_S32C1_MASK                     equ 0001h
LCDDATA10_S33C1_POSN                     equ 0001h
LCDDATA10_S33C1_POSITION                 equ 0001h
LCDDATA10_S33C1_SIZE                     equ 0001h
LCDDATA10_S33C1_LENGTH                   equ 0001h
LCDDATA10_S33C1_MASK                     equ 0002h
LCDDATA10_S34C1_POSN                     equ 0002h
LCDDATA10_S34C1_POSITION                 equ 0002h
LCDDATA10_S34C1_SIZE                     equ 0001h
LCDDATA10_S34C1_LENGTH                   equ 0001h
LCDDATA10_S34C1_MASK                     equ 0004h
LCDDATA10_S35C1_POSN                     equ 0003h
LCDDATA10_S35C1_POSITION                 equ 0003h
LCDDATA10_S35C1_SIZE                     equ 0001h
LCDDATA10_S35C1_LENGTH                   equ 0001h
LCDDATA10_S35C1_MASK                     equ 0008h
LCDDATA10_S36C1_POSN                     equ 0004h
LCDDATA10_S36C1_POSITION                 equ 0004h
LCDDATA10_S36C1_SIZE                     equ 0001h
LCDDATA10_S36C1_LENGTH                   equ 0001h
LCDDATA10_S36C1_MASK                     equ 0010h
LCDDATA10_S37C1_POSN                     equ 0005h
LCDDATA10_S37C1_POSITION                 equ 0005h
LCDDATA10_S37C1_SIZE                     equ 0001h
LCDDATA10_S37C1_LENGTH                   equ 0001h
LCDDATA10_S37C1_MASK                     equ 0020h
LCDDATA10_S38C1_POSN                     equ 0006h
LCDDATA10_S38C1_POSITION                 equ 0006h
LCDDATA10_S38C1_SIZE                     equ 0001h
LCDDATA10_S38C1_LENGTH                   equ 0001h
LCDDATA10_S38C1_MASK                     equ 0040h
LCDDATA10_S39C1_POSN                     equ 0007h
LCDDATA10_S39C1_POSITION                 equ 0007h
LCDDATA10_S39C1_SIZE                     equ 0001h
LCDDATA10_S39C1_LENGTH                   equ 0001h
LCDDATA10_S39C1_MASK                     equ 0080h

// Register: LCDDATA11
#define LCDDATA11 LCDDATA11
LCDDATA11                                equ 0F71h
// bitfield definitions
LCDDATA11_S40C1_POSN                     equ 0000h
LCDDATA11_S40C1_POSITION                 equ 0000h
LCDDATA11_S40C1_SIZE                     equ 0001h
LCDDATA11_S40C1_LENGTH                   equ 0001h
LCDDATA11_S40C1_MASK                     equ 0001h
LCDDATA11_S41C1_POSN                     equ 0001h
LCDDATA11_S41C1_POSITION                 equ 0001h
LCDDATA11_S41C1_SIZE                     equ 0001h
LCDDATA11_S41C1_LENGTH                   equ 0001h
LCDDATA11_S41C1_MASK                     equ 0002h
LCDDATA11_S42C1_POSN                     equ 0002h
LCDDATA11_S42C1_POSITION                 equ 0002h
LCDDATA11_S42C1_SIZE                     equ 0001h
LCDDATA11_S42C1_LENGTH                   equ 0001h
LCDDATA11_S42C1_MASK                     equ 0004h
LCDDATA11_S43C1_POSN                     equ 0003h
LCDDATA11_S43C1_POSITION                 equ 0003h
LCDDATA11_S43C1_SIZE                     equ 0001h
LCDDATA11_S43C1_LENGTH                   equ 0001h
LCDDATA11_S43C1_MASK                     equ 0008h
LCDDATA11_S44C1_POSN                     equ 0004h
LCDDATA11_S44C1_POSITION                 equ 0004h
LCDDATA11_S44C1_SIZE                     equ 0001h
LCDDATA11_S44C1_LENGTH                   equ 0001h
LCDDATA11_S44C1_MASK                     equ 0010h
LCDDATA11_S45C1_POSN                     equ 0005h
LCDDATA11_S45C1_POSITION                 equ 0005h
LCDDATA11_S45C1_SIZE                     equ 0001h
LCDDATA11_S45C1_LENGTH                   equ 0001h
LCDDATA11_S45C1_MASK                     equ 0020h
LCDDATA11_S46C1_POSN                     equ 0006h
LCDDATA11_S46C1_POSITION                 equ 0006h
LCDDATA11_S46C1_SIZE                     equ 0001h
LCDDATA11_S46C1_LENGTH                   equ 0001h
LCDDATA11_S46C1_MASK                     equ 0040h
LCDDATA11_S47C1_POSN                     equ 0007h
LCDDATA11_S47C1_POSITION                 equ 0007h
LCDDATA11_S47C1_SIZE                     equ 0001h
LCDDATA11_S47C1_LENGTH                   equ 0001h
LCDDATA11_S47C1_MASK                     equ 0080h
LCDDATA11_ADMSK1_POSN                    equ 0001h
LCDDATA11_ADMSK1_POSITION                equ 0001h
LCDDATA11_ADMSK1_SIZE                    equ 0001h
LCDDATA11_ADMSK1_LENGTH                  equ 0001h
LCDDATA11_ADMSK1_MASK                    equ 0002h
LCDDATA11_ADMSK2_POSN                    equ 0002h
LCDDATA11_ADMSK2_POSITION                equ 0002h
LCDDATA11_ADMSK2_SIZE                    equ 0001h
LCDDATA11_ADMSK2_LENGTH                  equ 0001h
LCDDATA11_ADMSK2_MASK                    equ 0004h
LCDDATA11_ADMSK3_POSN                    equ 0003h
LCDDATA11_ADMSK3_POSITION                equ 0003h
LCDDATA11_ADMSK3_SIZE                    equ 0001h
LCDDATA11_ADMSK3_LENGTH                  equ 0001h
LCDDATA11_ADMSK3_MASK                    equ 0008h
LCDDATA11_ADMSK4_POSN                    equ 0004h
LCDDATA11_ADMSK4_POSITION                equ 0004h
LCDDATA11_ADMSK4_SIZE                    equ 0001h
LCDDATA11_ADMSK4_LENGTH                  equ 0001h
LCDDATA11_ADMSK4_MASK                    equ 0010h
LCDDATA11_ADMSK5_POSN                    equ 0005h
LCDDATA11_ADMSK5_POSITION                equ 0005h
LCDDATA11_ADMSK5_SIZE                    equ 0001h
LCDDATA11_ADMSK5_LENGTH                  equ 0001h
LCDDATA11_ADMSK5_MASK                    equ 0020h

// Register: LCDDATA12
#define LCDDATA12 LCDDATA12
LCDDATA12                                equ 0F72h
// bitfield definitions
LCDDATA12_S00C2_POSN                     equ 0000h
LCDDATA12_S00C2_POSITION                 equ 0000h
LCDDATA12_S00C2_SIZE                     equ 0001h
LCDDATA12_S00C2_LENGTH                   equ 0001h
LCDDATA12_S00C2_MASK                     equ 0001h
LCDDATA12_S01C2_POSN                     equ 0001h
LCDDATA12_S01C2_POSITION                 equ 0001h
LCDDATA12_S01C2_SIZE                     equ 0001h
LCDDATA12_S01C2_LENGTH                   equ 0001h
LCDDATA12_S01C2_MASK                     equ 0002h
LCDDATA12_S02C2_POSN                     equ 0002h
LCDDATA12_S02C2_POSITION                 equ 0002h
LCDDATA12_S02C2_SIZE                     equ 0001h
LCDDATA12_S02C2_LENGTH                   equ 0001h
LCDDATA12_S02C2_MASK                     equ 0004h
LCDDATA12_S03C2_POSN                     equ 0003h
LCDDATA12_S03C2_POSITION                 equ 0003h
LCDDATA12_S03C2_SIZE                     equ 0001h
LCDDATA12_S03C2_LENGTH                   equ 0001h
LCDDATA12_S03C2_MASK                     equ 0008h
LCDDATA12_S04C2_POSN                     equ 0004h
LCDDATA12_S04C2_POSITION                 equ 0004h
LCDDATA12_S04C2_SIZE                     equ 0001h
LCDDATA12_S04C2_LENGTH                   equ 0001h
LCDDATA12_S04C2_MASK                     equ 0010h
LCDDATA12_S05C2_POSN                     equ 0005h
LCDDATA12_S05C2_POSITION                 equ 0005h
LCDDATA12_S05C2_SIZE                     equ 0001h
LCDDATA12_S05C2_LENGTH                   equ 0001h
LCDDATA12_S05C2_MASK                     equ 0020h
LCDDATA12_S06C2_POSN                     equ 0006h
LCDDATA12_S06C2_POSITION                 equ 0006h
LCDDATA12_S06C2_SIZE                     equ 0001h
LCDDATA12_S06C2_LENGTH                   equ 0001h
LCDDATA12_S06C2_MASK                     equ 0040h
LCDDATA12_S07C2_POSN                     equ 0007h
LCDDATA12_S07C2_POSITION                 equ 0007h
LCDDATA12_S07C2_SIZE                     equ 0001h
LCDDATA12_S07C2_LENGTH                   equ 0001h
LCDDATA12_S07C2_MASK                     equ 0080h
LCDDATA12_SSPM012_POSN                   equ 0000h
LCDDATA12_SSPM012_POSITION               equ 0000h
LCDDATA12_SSPM012_SIZE                   equ 0001h
LCDDATA12_SSPM012_LENGTH                 equ 0001h
LCDDATA12_SSPM012_MASK                   equ 0001h
LCDDATA12_SSPM112_POSN                   equ 0001h
LCDDATA12_SSPM112_POSITION               equ 0001h
LCDDATA12_SSPM112_SIZE                   equ 0001h
LCDDATA12_SSPM112_LENGTH                 equ 0001h
LCDDATA12_SSPM112_MASK                   equ 0002h
LCDDATA12_SSPM212_POSN                   equ 0002h
LCDDATA12_SSPM212_POSITION               equ 0002h
LCDDATA12_SSPM212_SIZE                   equ 0001h
LCDDATA12_SSPM212_LENGTH                 equ 0001h
LCDDATA12_SSPM212_MASK                   equ 0004h
LCDDATA12_SSPM312_POSN                   equ 0003h
LCDDATA12_SSPM312_POSITION               equ 0003h
LCDDATA12_SSPM312_SIZE                   equ 0001h
LCDDATA12_SSPM312_LENGTH                 equ 0001h
LCDDATA12_SSPM312_MASK                   equ 0008h

