GopalSaraf/Practicals/PSDL/include/proc/pic18f87k90.inc
// Register: LCDDATA20
#define LCDDATA20 LCDDATA20
LCDDATA20                                equ 0F7Ah
// bitfield definitions
LCDDATA20_S16C3_POSN                     equ 0000h
LCDDATA20_S16C3_POSITION                 equ 0000h
LCDDATA20_S16C3_SIZE                     equ 0001h
LCDDATA20_S16C3_LENGTH                   equ 0001h
LCDDATA20_S16C3_MASK                     equ 0001h
LCDDATA20_S17C3_POSN                     equ 0001h
LCDDATA20_S17C3_POSITION                 equ 0001h
LCDDATA20_S17C3_SIZE                     equ 0001h
LCDDATA20_S17C3_LENGTH                   equ 0001h
LCDDATA20_S17C3_MASK                     equ 0002h
LCDDATA20_S18C3_POSN                     equ 0002h
LCDDATA20_S18C3_POSITION                 equ 0002h
LCDDATA20_S18C3_SIZE                     equ 0001h
LCDDATA20_S18C3_LENGTH                   equ 0001h
LCDDATA20_S18C3_MASK                     equ 0004h
LCDDATA20_S19C3_POSN                     equ 0003h
LCDDATA20_S19C3_POSITION                 equ 0003h
LCDDATA20_S19C3_SIZE                     equ 0001h
LCDDATA20_S19C3_LENGTH                   equ 0001h
LCDDATA20_S19C3_MASK                     equ 0008h
LCDDATA20_S20C3_POSN                     equ 0004h
LCDDATA20_S20C3_POSITION                 equ 0004h
LCDDATA20_S20C3_SIZE                     equ 0001h
LCDDATA20_S20C3_LENGTH                   equ 0001h
LCDDATA20_S20C3_MASK                     equ 0010h
LCDDATA20_S21C3_POSN                     equ 0005h
LCDDATA20_S21C3_POSITION                 equ 0005h
LCDDATA20_S21C3_SIZE                     equ 0001h
LCDDATA20_S21C3_LENGTH                   equ 0001h
LCDDATA20_S21C3_MASK                     equ 0020h
LCDDATA20_S22C3_POSN                     equ 0006h
LCDDATA20_S22C3_POSITION                 equ 0006h
LCDDATA20_S22C3_SIZE                     equ 0001h
LCDDATA20_S22C3_LENGTH                   equ 0001h
LCDDATA20_S22C3_MASK                     equ 0040h
LCDDATA20_S23C3_POSN                     equ 0007h
LCDDATA20_S23C3_POSITION                 equ 0007h
LCDDATA20_S23C3_SIZE                     equ 0001h
LCDDATA20_S23C3_LENGTH                   equ 0001h
LCDDATA20_S23C3_MASK                     equ 0080h

// Register: LCDDATA21
#define LCDDATA21 LCDDATA21
LCDDATA21                                equ 0F7Bh
// bitfield definitions
LCDDATA21_S24C3_POSN                     equ 0000h
LCDDATA21_S24C3_POSITION                 equ 0000h
LCDDATA21_S24C3_SIZE                     equ 0001h
LCDDATA21_S24C3_LENGTH                   equ 0001h
LCDDATA21_S24C3_MASK                     equ 0001h
LCDDATA21_S25C3_POSN                     equ 0001h
LCDDATA21_S25C3_POSITION                 equ 0001h
LCDDATA21_S25C3_SIZE                     equ 0001h
LCDDATA21_S25C3_LENGTH                   equ 0001h
LCDDATA21_S25C3_MASK                     equ 0002h
LCDDATA21_S26C3_POSN                     equ 0002h
LCDDATA21_S26C3_POSITION                 equ 0002h
LCDDATA21_S26C3_SIZE                     equ 0001h
LCDDATA21_S26C3_LENGTH                   equ 0001h
LCDDATA21_S26C3_MASK                     equ 0004h
LCDDATA21_S27C3_POSN                     equ 0003h
LCDDATA21_S27C3_POSITION                 equ 0003h
LCDDATA21_S27C3_SIZE                     equ 0001h
LCDDATA21_S27C3_LENGTH                   equ 0001h
LCDDATA21_S27C3_MASK                     equ 0008h
LCDDATA21_S28C3_POSN                     equ 0004h
LCDDATA21_S28C3_POSITION                 equ 0004h
LCDDATA21_S28C3_SIZE                     equ 0001h
LCDDATA21_S28C3_LENGTH                   equ 0001h
LCDDATA21_S28C3_MASK                     equ 0010h
LCDDATA21_S29C3_POSN                     equ 0005h
LCDDATA21_S29C3_POSITION                 equ 0005h
LCDDATA21_S29C3_SIZE                     equ 0001h
LCDDATA21_S29C3_LENGTH                   equ 0001h
LCDDATA21_S29C3_MASK                     equ 0020h
LCDDATA21_S30C3_POSN                     equ 0006h
LCDDATA21_S30C3_POSITION                 equ 0006h
LCDDATA21_S30C3_SIZE                     equ 0001h
LCDDATA21_S30C3_LENGTH                   equ 0001h
LCDDATA21_S30C3_MASK                     equ 0040h
LCDDATA21_S31C3_POSN                     equ 0007h
LCDDATA21_S31C3_POSITION                 equ 0007h
LCDDATA21_S31C3_SIZE                     equ 0001h
LCDDATA21_S31C3_LENGTH                   equ 0001h
LCDDATA21_S31C3_MASK                     equ 0080h

// Register: LCDDATA22
#define LCDDATA22 LCDDATA22
LCDDATA22                                equ 0F7Ch
// bitfield definitions
LCDDATA22_S32C3_POSN                     equ 0000h
LCDDATA22_S32C3_POSITION                 equ 0000h
LCDDATA22_S32C3_SIZE                     equ 0001h
LCDDATA22_S32C3_LENGTH                   equ 0001h
LCDDATA22_S32C3_MASK                     equ 0001h
LCDDATA22_S33C3_POSN                     equ 0001h
LCDDATA22_S33C3_POSITION                 equ 0001h
LCDDATA22_S33C3_SIZE                     equ 0001h
LCDDATA22_S33C3_LENGTH                   equ 0001h
LCDDATA22_S33C3_MASK                     equ 0002h
LCDDATA22_S34C3_POSN                     equ 0002h
LCDDATA22_S34C3_POSITION                 equ 0002h
LCDDATA22_S34C3_SIZE                     equ 0001h
LCDDATA22_S34C3_LENGTH                   equ 0001h
LCDDATA22_S34C3_MASK                     equ 0004h
LCDDATA22_S35C3_POSN                     equ 0003h
LCDDATA22_S35C3_POSITION                 equ 0003h
LCDDATA22_S35C3_SIZE                     equ 0001h
LCDDATA22_S35C3_LENGTH                   equ 0001h
LCDDATA22_S35C3_MASK                     equ 0008h
LCDDATA22_S36C3_POSN                     equ 0004h
LCDDATA22_S36C3_POSITION                 equ 0004h
LCDDATA22_S36C3_SIZE                     equ 0001h
LCDDATA22_S36C3_LENGTH                   equ 0001h
LCDDATA22_S36C3_MASK                     equ 0010h
LCDDATA22_S37C3_POSN                     equ 0005h
LCDDATA22_S37C3_POSITION                 equ 0005h
LCDDATA22_S37C3_SIZE                     equ 0001h
LCDDATA22_S37C3_LENGTH                   equ 0001h
LCDDATA22_S37C3_MASK                     equ 0020h
LCDDATA22_S38C3_POSN                     equ 0006h
LCDDATA22_S38C3_POSITION                 equ 0006h
LCDDATA22_S38C3_SIZE                     equ 0001h
LCDDATA22_S38C3_LENGTH                   equ 0001h
LCDDATA22_S38C3_MASK                     equ 0040h
LCDDATA22_S39C3_POSN                     equ 0007h
LCDDATA22_S39C3_POSITION                 equ 0007h
LCDDATA22_S39C3_SIZE                     equ 0001h
LCDDATA22_S39C3_LENGTH                   equ 0001h
LCDDATA22_S39C3_MASK                     equ 0080h

// Register: LCDDATA23
#define LCDDATA23 LCDDATA23
LCDDATA23                                equ 0F7Dh
// bitfield definitions
LCDDATA23_S40C3_POSN                     equ 0000h
LCDDATA23_S40C3_POSITION                 equ 0000h
LCDDATA23_S40C3_SIZE                     equ 0001h
LCDDATA23_S40C3_LENGTH                   equ 0001h
LCDDATA23_S40C3_MASK                     equ 0001h
LCDDATA23_S41C3_POSN                     equ 0001h
LCDDATA23_S41C3_POSITION                 equ 0001h
LCDDATA23_S41C3_SIZE                     equ 0001h
LCDDATA23_S41C3_LENGTH                   equ 0001h
LCDDATA23_S41C3_MASK                     equ 0002h
LCDDATA23_S42C3_POSN                     equ 0002h
LCDDATA23_S42C3_POSITION                 equ 0002h
LCDDATA23_S42C3_SIZE                     equ 0001h
LCDDATA23_S42C3_LENGTH                   equ 0001h
LCDDATA23_S42C3_MASK                     equ 0004h
LCDDATA23_S43C3_POSN                     equ 0003h
LCDDATA23_S43C3_POSITION                 equ 0003h
LCDDATA23_S43C3_SIZE                     equ 0001h
LCDDATA23_S43C3_LENGTH                   equ 0001h
LCDDATA23_S43C3_MASK                     equ 0008h
LCDDATA23_S44C3_POSN                     equ 0004h
LCDDATA23_S44C3_POSITION                 equ 0004h
LCDDATA23_S44C3_SIZE                     equ 0001h
LCDDATA23_S44C3_LENGTH                   equ 0001h
LCDDATA23_S44C3_MASK                     equ 0010h
LCDDATA23_S45C3_POSN                     equ 0005h
LCDDATA23_S45C3_POSITION                 equ 0005h
LCDDATA23_S45C3_SIZE                     equ 0001h
LCDDATA23_S45C3_LENGTH                   equ 0001h
LCDDATA23_S45C3_MASK                     equ 0020h
LCDDATA23_S46C3_POSN                     equ 0006h
LCDDATA23_S46C3_POSITION                 equ 0006h
LCDDATA23_S46C3_SIZE                     equ 0001h
LCDDATA23_S46C3_LENGTH                   equ 0001h
LCDDATA23_S46C3_MASK                     equ 0040h
LCDDATA23_S47C3_POSN                     equ 0007h
LCDDATA23_S47C3_POSITION                 equ 0007h
LCDDATA23_S47C3_SIZE                     equ 0001h
LCDDATA23_S47C3_LENGTH                   equ 0001h
LCDDATA23_S47C3_MASK                     equ 0080h

// Register: EECON2
#define EECON2 EECON2
EECON2                                   equ 0F7Eh
// bitfield definitions
EECON2_EECON2_POSN                       equ 0000h
EECON2_EECON2_POSITION                   equ 0000h
EECON2_EECON2_SIZE                       equ 0008h
EECON2_EECON2_LENGTH                     equ 0008h
EECON2_EECON2_MASK                       equ 00FFh

// Register: EECON1
#define EECON1 EECON1
EECON1                                   equ 0F7Fh
// bitfield definitions
EECON1_RD_POSN                           equ 0000h
EECON1_RD_POSITION                       equ 0000h
EECON1_RD_SIZE                           equ 0001h
EECON1_RD_LENGTH                         equ 0001h
EECON1_RD_MASK                           equ 0001h
EECON1_WR_POSN                           equ 0001h
EECON1_WR_POSITION                       equ 0001h
EECON1_WR_SIZE                           equ 0001h
EECON1_WR_LENGTH                         equ 0001h
EECON1_WR_MASK                           equ 0002h
EECON1_WREN_POSN                         equ 0002h
EECON1_WREN_POSITION                     equ 0002h
EECON1_WREN_SIZE                         equ 0001h
EECON1_WREN_LENGTH                       equ 0001h
EECON1_WREN_MASK                         equ 0004h
EECON1_WRERR_POSN                        equ 0003h
EECON1_WRERR_POSITION                    equ 0003h
EECON1_WRERR_SIZE                        equ 0001h
EECON1_WRERR_LENGTH                      equ 0001h
EECON1_WRERR_MASK                        equ 0008h
EECON1_FREE_POSN                         equ 0004h
EECON1_FREE_POSITION                     equ 0004h
EECON1_FREE_SIZE                         equ 0001h
EECON1_FREE_LENGTH                       equ 0001h
EECON1_FREE_MASK                         equ 0010h
EECON1_CFGS_POSN                         equ 0006h
EECON1_CFGS_POSITION                     equ 0006h
EECON1_CFGS_SIZE                         equ 0001h
EECON1_CFGS_LENGTH                       equ 0001h
EECON1_CFGS_MASK                         equ 0040h
EECON1_EEPGD_POSN                        equ 0007h
EECON1_EEPGD_POSITION                    equ 0007h
EECON1_EEPGD_SIZE                        equ 0001h
EECON1_EEPGD_LENGTH                      equ 0001h
EECON1_EEPGD_MASK                        equ 0080h
EECON1_EEFS_POSN                         equ 0006h
EECON1_EEFS_POSITION                     equ 0006h
EECON1_EEFS_SIZE                         equ 0001h
EECON1_EEFS_LENGTH                       equ 0001h
EECON1_EEFS_MASK                         equ 0040h

// Register: PORTA
#define PORTA PORTA
PORTA                                    equ 0F80h
// bitfield definitions
PORTA_RA0_POSN                           equ 0000h
PORTA_RA0_POSITION                       equ 0000h
PORTA_RA0_SIZE                           equ 0001h
PORTA_RA0_LENGTH                         equ 0001h
PORTA_RA0_MASK                           equ 0001h
PORTA_RA1_POSN                           equ 0001h
PORTA_RA1_POSITION                       equ 0001h
PORTA_RA1_SIZE                           equ 0001h
PORTA_RA1_LENGTH                         equ 0001h
PORTA_RA1_MASK                           equ 0002h
PORTA_RA2_POSN                           equ 0002h
PORTA_RA2_POSITION                       equ 0002h
PORTA_RA2_SIZE                           equ 0001h
PORTA_RA2_LENGTH                         equ 0001h
PORTA_RA2_MASK                           equ 0004h
PORTA_RA3_POSN                           equ 0003h
PORTA_RA3_POSITION                       equ 0003h
PORTA_RA3_SIZE                           equ 0001h
PORTA_RA3_LENGTH                         equ 0001h
PORTA_RA3_MASK                           equ 0008h
PORTA_RA4_POSN                           equ 0004h
PORTA_RA4_POSITION                       equ 0004h
PORTA_RA4_SIZE                           equ 0001h
PORTA_RA4_LENGTH                         equ 0001h
PORTA_RA4_MASK                           equ 0010h
PORTA_RA5_POSN                           equ 0005h
PORTA_RA5_POSITION                       equ 0005h
PORTA_RA5_SIZE                           equ 0001h
PORTA_RA5_LENGTH                         equ 0001h
PORTA_RA5_MASK                           equ 0020h
PORTA_RA6_POSN                           equ 0006h
PORTA_RA6_POSITION                       equ 0006h
PORTA_RA6_SIZE                           equ 0001h
PORTA_RA6_LENGTH                         equ 0001h
PORTA_RA6_MASK                           equ 0040h
PORTA_RA7_POSN                           equ 0007h
PORTA_RA7_POSITION                       equ 0007h
PORTA_RA7_SIZE                           equ 0001h
PORTA_RA7_LENGTH                         equ 0001h
PORTA_RA7_MASK                           equ 0080h
PORTA_AN0_POSN                           equ 0000h
PORTA_AN0_POSITION                       equ 0000h
PORTA_AN0_SIZE                           equ 0001h
PORTA_AN0_LENGTH                         equ 0001h
PORTA_AN0_MASK                           equ 0001h
PORTA_AN1_POSN                           equ 0001h
PORTA_AN1_POSITION                       equ 0001h
PORTA_AN1_SIZE                           equ 0001h
PORTA_AN1_LENGTH                         equ 0001h
PORTA_AN1_MASK                           equ 0002h
PORTA_AN2_POSN                           equ 0002h
PORTA_AN2_POSITION                       equ 0002h
PORTA_AN2_SIZE                           equ 0001h
PORTA_AN2_LENGTH                         equ 0001h
PORTA_AN2_MASK                           equ 0004h
PORTA_AN3_POSN                           equ 0003h
PORTA_AN3_POSITION                       equ 0003h
PORTA_AN3_SIZE                           equ 0001h
PORTA_AN3_LENGTH                         equ 0001h
PORTA_AN3_MASK                           equ 0008h
PORTA_AN4_POSN                           equ 0005h
PORTA_AN4_POSITION                       equ 0005h
PORTA_AN4_SIZE                           equ 0001h
PORTA_AN4_LENGTH                         equ 0001h
PORTA_AN4_MASK                           equ 0020h
PORTA_OSC2_POSN                          equ 0006h
PORTA_OSC2_POSITION                      equ 0006h
PORTA_OSC2_SIZE                          equ 0001h
PORTA_OSC2_LENGTH                        equ 0001h
PORTA_OSC2_MASK                          equ 0040h
PORTA_OSC1_POSN                          equ 0007h
PORTA_OSC1_POSITION                      equ 0007h
PORTA_OSC1_SIZE                          equ 0001h
PORTA_OSC1_LENGTH                        equ 0001h
PORTA_OSC1_MASK                          equ 0080h
PORTA_ULPWUIN_POSN                       equ 0000h
PORTA_ULPWUIN_POSITION                   equ 0000h
PORTA_ULPWUIN_SIZE                       equ 0001h
PORTA_ULPWUIN_LENGTH                     equ 0001h
PORTA_ULPWUIN_MASK                       equ 0001h
PORTA_SEG18_POSN                         equ 0001h
PORTA_SEG18_POSITION                     equ 0001h
PORTA_SEG18_SIZE                         equ 0001h
PORTA_SEG18_LENGTH                       equ 0001h
PORTA_SEG18_MASK                         equ 0002h
PORTA_VREF_MINUS_POSN                    equ 0002h
PORTA_VREF_MINUS_POSITION                equ 0002h
PORTA_VREF_MINUS_SIZE                    equ 0001h
PORTA_VREF_MINUS_LENGTH                  equ 0001h
PORTA_VREF_MINUS_MASK                    equ 0004h
PORTA_VREF_PLUS_POSN                     equ 0003h
PORTA_VREF_PLUS_POSITION                 equ 0003h
PORTA_VREF_PLUS_SIZE                     equ 0001h
PORTA_VREF_PLUS_LENGTH                   equ 0001h
PORTA_VREF_PLUS_MASK                     equ 0008h
PORTA_SEG14_POSN                         equ 0004h
PORTA_SEG14_POSITION                     equ 0004h
PORTA_SEG14_SIZE                         equ 0001h
PORTA_SEG14_LENGTH                       equ 0001h
PORTA_SEG14_MASK                         equ 0010h
PORTA_SEG15_POSN                         equ 0005h
PORTA_SEG15_POSITION                     equ 0005h
PORTA_SEG15_SIZE                         equ 0001h
PORTA_SEG15_LENGTH                       equ 0001h
PORTA_SEG15_MASK                         equ 0020h
PORTA_CLKO_POSN                          equ 0006h
PORTA_CLKO_POSITION                      equ 0006h
PORTA_CLKO_SIZE                          equ 0001h
PORTA_CLKO_LENGTH                        equ 0001h
PORTA_CLKO_MASK                          equ 0040h
PORTA_CLKI_POSN                          equ 0007h
PORTA_CLKI_POSITION                      equ 0007h
PORTA_CLKI_SIZE                          equ 0001h
PORTA_CLKI_LENGTH                        equ 0001h
PORTA_CLKI_MASK                          equ 0080h
PORTA_T0CKI_POSN                         equ 0004h
PORTA_T0CKI_POSITION                     equ 0004h
PORTA_T0CKI_SIZE                         equ 0001h
PORTA_T0CKI_LENGTH                       equ 0001h
PORTA_T0CKI_MASK                         equ 0010h
PORTA_T1CKI_POSN                         equ 0005h
PORTA_T1CKI_POSITION                     equ 0005h
PORTA_T1CKI_SIZE                         equ 0001h
PORTA_T1CKI_LENGTH                       equ 0001h
PORTA_T1CKI_MASK                         equ 0020h
PORTA_T3G_POSN                           equ 0005h
PORTA_T3G_POSITION                       equ 0005h
PORTA_T3G_SIZE                           equ 0001h
PORTA_T3G_LENGTH                         equ 0001h
PORTA_T3G_MASK                           equ 0020h
PORTA_LVDIN_POSN                         equ 0005h
PORTA_LVDIN_POSITION                     equ 0005h
PORTA_LVDIN_SIZE                         equ 0001h
PORTA_LVDIN_LENGTH                       equ 0001h
PORTA_LVDIN_MASK                         equ 0020h
PORTA_RJPU_POSN                          equ 0007h
PORTA_RJPU_POSITION                      equ 0007h
PORTA_RJPU_SIZE                          equ 0001h
PORTA_RJPU_LENGTH                        equ 0001h
PORTA_RJPU_MASK                          equ 0080h

