GopalSaraf/Practicals/PSDL/include/proc/pic18f87k90.inc
// Register: IPR4
#define IPR4 IPR4
IPR4                                     equ 0FB8h
// bitfield definitions
IPR4_CCP3IP_POSN                         equ 0000h
IPR4_CCP3IP_POSITION                     equ 0000h
IPR4_CCP3IP_SIZE                         equ 0001h
IPR4_CCP3IP_LENGTH                       equ 0001h
IPR4_CCP3IP_MASK                         equ 0001h
IPR4_CCP4IP_POSN                         equ 0001h
IPR4_CCP4IP_POSITION                     equ 0001h
IPR4_CCP4IP_SIZE                         equ 0001h
IPR4_CCP4IP_LENGTH                       equ 0001h
IPR4_CCP4IP_MASK                         equ 0002h
IPR4_CCP5IP_POSN                         equ 0002h
IPR4_CCP5IP_POSITION                     equ 0002h
IPR4_CCP5IP_SIZE                         equ 0001h
IPR4_CCP5IP_LENGTH                       equ 0001h
IPR4_CCP5IP_MASK                         equ 0004h
IPR4_CCP6IP_POSN                         equ 0003h
IPR4_CCP6IP_POSITION                     equ 0003h
IPR4_CCP6IP_SIZE                         equ 0001h
IPR4_CCP6IP_LENGTH                       equ 0001h
IPR4_CCP6IP_MASK                         equ 0008h
IPR4_CCP7IP_POSN                         equ 0004h
IPR4_CCP7IP_POSITION                     equ 0004h
IPR4_CCP7IP_SIZE                         equ 0001h
IPR4_CCP7IP_LENGTH                       equ 0001h
IPR4_CCP7IP_MASK                         equ 0010h
IPR4_CCP8IP_POSN                         equ 0005h
IPR4_CCP8IP_POSITION                     equ 0005h
IPR4_CCP8IP_SIZE                         equ 0001h
IPR4_CCP8IP_LENGTH                       equ 0001h
IPR4_CCP8IP_MASK                         equ 0020h
IPR4_CCP9IP_POSN                         equ 0006h
IPR4_CCP9IP_POSITION                     equ 0006h
IPR4_CCP9IP_SIZE                         equ 0001h
IPR4_CCP9IP_LENGTH                       equ 0001h
IPR4_CCP9IP_MASK                         equ 0040h
IPR4_CCP10IP_POSN                        equ 0007h
IPR4_CCP10IP_POSITION                    equ 0007h
IPR4_CCP10IP_SIZE                        equ 0001h
IPR4_CCP10IP_LENGTH                      equ 0001h
IPR4_CCP10IP_MASK                        equ 0080h
IPR4_CCIP3IP_POSN                        equ 0000h
IPR4_CCIP3IP_POSITION                    equ 0000h
IPR4_CCIP3IP_SIZE                        equ 0001h
IPR4_CCIP3IP_LENGTH                      equ 0001h
IPR4_CCIP3IP_MASK                        equ 0001h

// Register: PIE5
#define PIE5 PIE5
PIE5                                     equ 0FB9h
// bitfield definitions
PIE5_TMR4IE_POSN                         equ 0000h
PIE5_TMR4IE_POSITION                     equ 0000h
PIE5_TMR4IE_SIZE                         equ 0001h
PIE5_TMR4IE_LENGTH                       equ 0001h
PIE5_TMR4IE_MASK                         equ 0001h
PIE5_TMR5IE_POSN                         equ 0001h
PIE5_TMR5IE_POSITION                     equ 0001h
PIE5_TMR5IE_SIZE                         equ 0001h
PIE5_TMR5IE_LENGTH                       equ 0001h
PIE5_TMR5IE_MASK                         equ 0002h
PIE5_TMR6IE_POSN                         equ 0002h
PIE5_TMR6IE_POSITION                     equ 0002h
PIE5_TMR6IE_SIZE                         equ 0001h
PIE5_TMR6IE_LENGTH                       equ 0001h
PIE5_TMR6IE_MASK                         equ 0004h
PIE5_TMR7IE_POSN                         equ 0003h
PIE5_TMR7IE_POSITION                     equ 0003h
PIE5_TMR7IE_SIZE                         equ 0001h
PIE5_TMR7IE_LENGTH                       equ 0001h
PIE5_TMR7IE_MASK                         equ 0008h
PIE5_TMR8IE_POSN                         equ 0004h
PIE5_TMR8IE_POSITION                     equ 0004h
PIE5_TMR8IE_SIZE                         equ 0001h
PIE5_TMR8IE_LENGTH                       equ 0001h
PIE5_TMR8IE_MASK                         equ 0010h
PIE5_TMR10IE_POSN                        equ 0005h
PIE5_TMR10IE_POSITION                    equ 0005h
PIE5_TMR10IE_SIZE                        equ 0001h
PIE5_TMR10IE_LENGTH                      equ 0001h
PIE5_TMR10IE_MASK                        equ 0020h
PIE5_TMR12IE_POSN                        equ 0006h
PIE5_TMR12IE_POSITION                    equ 0006h
PIE5_TMR12IE_SIZE                        equ 0001h
PIE5_TMR12IE_LENGTH                      equ 0001h
PIE5_TMR12IE_MASK                        equ 0040h
PIE5_TMR7GIE_POSN                        equ 0007h
PIE5_TMR7GIE_POSITION                    equ 0007h
PIE5_TMR7GIE_SIZE                        equ 0001h
PIE5_TMR7GIE_LENGTH                      equ 0001h
PIE5_TMR7GIE_MASK                        equ 0080h

// Register: PIR5
#define PIR5 PIR5
PIR5                                     equ 0FBAh
// bitfield definitions
PIR5_TMR4IF_POSN                         equ 0000h
PIR5_TMR4IF_POSITION                     equ 0000h
PIR5_TMR4IF_SIZE                         equ 0001h
PIR5_TMR4IF_LENGTH                       equ 0001h
PIR5_TMR4IF_MASK                         equ 0001h
PIR5_TMR5IF_POSN                         equ 0001h
PIR5_TMR5IF_POSITION                     equ 0001h
PIR5_TMR5IF_SIZE                         equ 0001h
PIR5_TMR5IF_LENGTH                       equ 0001h
PIR5_TMR5IF_MASK                         equ 0002h
PIR5_TMR6IF_POSN                         equ 0002h
PIR5_TMR6IF_POSITION                     equ 0002h
PIR5_TMR6IF_SIZE                         equ 0001h
PIR5_TMR6IF_LENGTH                       equ 0001h
PIR5_TMR6IF_MASK                         equ 0004h
PIR5_TMR7IF_POSN                         equ 0003h
PIR5_TMR7IF_POSITION                     equ 0003h
PIR5_TMR7IF_SIZE                         equ 0001h
PIR5_TMR7IF_LENGTH                       equ 0001h
PIR5_TMR7IF_MASK                         equ 0008h
PIR5_TMR8IF_POSN                         equ 0004h
PIR5_TMR8IF_POSITION                     equ 0004h
PIR5_TMR8IF_SIZE                         equ 0001h
PIR5_TMR8IF_LENGTH                       equ 0001h
PIR5_TMR8IF_MASK                         equ 0010h
PIR5_TMR10IF_POSN                        equ 0005h
PIR5_TMR10IF_POSITION                    equ 0005h
PIR5_TMR10IF_SIZE                        equ 0001h
PIR5_TMR10IF_LENGTH                      equ 0001h
PIR5_TMR10IF_MASK                        equ 0020h
PIR5_TMR12IF_POSN                        equ 0006h
PIR5_TMR12IF_POSITION                    equ 0006h
PIR5_TMR12IF_SIZE                        equ 0001h
PIR5_TMR12IF_LENGTH                      equ 0001h
PIR5_TMR12IF_MASK                        equ 0040h
PIR5_TMR7GIF_POSN                        equ 0007h
PIR5_TMR7GIF_POSITION                    equ 0007h
PIR5_TMR7GIF_SIZE                        equ 0001h
PIR5_TMR7GIF_LENGTH                      equ 0001h
PIR5_TMR7GIF_MASK                        equ 0080h

// Register: CCP1CON
#define CCP1CON CCP1CON
CCP1CON                                  equ 0FBBh
// bitfield definitions
CCP1CON_CCP1M_POSN                       equ 0000h
CCP1CON_CCP1M_POSITION                   equ 0000h
CCP1CON_CCP1M_SIZE                       equ 0004h
CCP1CON_CCP1M_LENGTH                     equ 0004h
CCP1CON_CCP1M_MASK                       equ 000Fh
CCP1CON_DC1B_POSN                        equ 0004h
CCP1CON_DC1B_POSITION                    equ 0004h
CCP1CON_DC1B_SIZE                        equ 0002h
CCP1CON_DC1B_LENGTH                      equ 0002h
CCP1CON_DC1B_MASK                        equ 0030h
CCP1CON_P1M_POSN                         equ 0006h
CCP1CON_P1M_POSITION                     equ 0006h
CCP1CON_P1M_SIZE                         equ 0002h
CCP1CON_P1M_LENGTH                       equ 0002h
CCP1CON_P1M_MASK                         equ 00C0h
CCP1CON_CCP1M0_POSN                      equ 0000h
CCP1CON_CCP1M0_POSITION                  equ 0000h
CCP1CON_CCP1M0_SIZE                      equ 0001h
CCP1CON_CCP1M0_LENGTH                    equ 0001h
CCP1CON_CCP1M0_MASK                      equ 0001h
CCP1CON_CCP1M1_POSN                      equ 0001h
CCP1CON_CCP1M1_POSITION                  equ 0001h
CCP1CON_CCP1M1_SIZE                      equ 0001h
CCP1CON_CCP1M1_LENGTH                    equ 0001h
CCP1CON_CCP1M1_MASK                      equ 0002h
CCP1CON_CCP1M2_POSN                      equ 0002h
CCP1CON_CCP1M2_POSITION                  equ 0002h
CCP1CON_CCP1M2_SIZE                      equ 0001h
CCP1CON_CCP1M2_LENGTH                    equ 0001h
CCP1CON_CCP1M2_MASK                      equ 0004h
CCP1CON_CCP1M3_POSN                      equ 0003h
CCP1CON_CCP1M3_POSITION                  equ 0003h
CCP1CON_CCP1M3_SIZE                      equ 0001h
CCP1CON_CCP1M3_LENGTH                    equ 0001h
CCP1CON_CCP1M3_MASK                      equ 0008h
CCP1CON_DC1B0_POSN                       equ 0004h
CCP1CON_DC1B0_POSITION                   equ 0004h
CCP1CON_DC1B0_SIZE                       equ 0001h
CCP1CON_DC1B0_LENGTH                     equ 0001h
CCP1CON_DC1B0_MASK                       equ 0010h
CCP1CON_DC1B1_POSN                       equ 0005h
CCP1CON_DC1B1_POSITION                   equ 0005h
CCP1CON_DC1B1_SIZE                       equ 0001h
CCP1CON_DC1B1_LENGTH                     equ 0001h
CCP1CON_DC1B1_MASK                       equ 0020h
CCP1CON_P1M0_POSN                        equ 0006h
CCP1CON_P1M0_POSITION                    equ 0006h
CCP1CON_P1M0_SIZE                        equ 0001h
CCP1CON_P1M0_LENGTH                      equ 0001h
CCP1CON_P1M0_MASK                        equ 0040h
CCP1CON_P1M1_POSN                        equ 0007h
CCP1CON_P1M1_POSITION                    equ 0007h
CCP1CON_P1M1_SIZE                        equ 0001h
CCP1CON_P1M1_LENGTH                      equ 0001h
CCP1CON_P1M1_MASK                        equ 0080h
CCP1CON_CCP1Y_POSN                       equ 0004h
CCP1CON_CCP1Y_POSITION                   equ 0004h
CCP1CON_CCP1Y_SIZE                       equ 0001h
CCP1CON_CCP1Y_LENGTH                     equ 0001h
CCP1CON_CCP1Y_MASK                       equ 0010h
CCP1CON_CCP1X_POSN                       equ 0005h
CCP1CON_CCP1X_POSITION                   equ 0005h
CCP1CON_CCP1X_SIZE                       equ 0001h
CCP1CON_CCP1X_LENGTH                     equ 0001h
CCP1CON_CCP1X_MASK                       equ 0020h

// Register: CCPR1
#define CCPR1 CCPR1
CCPR1                                    equ 0FBCh

// Register: CCPR1L
#define CCPR1L CCPR1L
CCPR1L                                   equ 0FBCh
// bitfield definitions
CCPR1L_CCPR1L_POSN                       equ 0000h
CCPR1L_CCPR1L_POSITION                   equ 0000h
CCPR1L_CCPR1L_SIZE                       equ 0008h
CCPR1L_CCPR1L_LENGTH                     equ 0008h
CCPR1L_CCPR1L_MASK                       equ 00FFh

// Register: CCPR1H
#define CCPR1H CCPR1H
CCPR1H                                   equ 0FBDh
// bitfield definitions
CCPR1H_CCPR1H_POSN                       equ 0000h
CCPR1H_CCPR1H_POSITION                   equ 0000h
CCPR1H_CCPR1H_SIZE                       equ 0008h
CCPR1H_CCPR1H_LENGTH                     equ 0008h
CCPR1H_CCPR1H_MASK                       equ 00FFh

// Register: ECCP1DEL
#define ECCP1DEL ECCP1DEL
ECCP1DEL                                 equ 0FBEh
// bitfield definitions
ECCP1DEL_P1DC_POSN                       equ 0000h
ECCP1DEL_P1DC_POSITION                   equ 0000h
ECCP1DEL_P1DC_SIZE                       equ 0007h
ECCP1DEL_P1DC_LENGTH                     equ 0007h
ECCP1DEL_P1DC_MASK                       equ 007Fh
ECCP1DEL_P1RSEN_POSN                     equ 0007h
ECCP1DEL_P1RSEN_POSITION                 equ 0007h
ECCP1DEL_P1RSEN_SIZE                     equ 0001h
ECCP1DEL_P1RSEN_LENGTH                   equ 0001h
ECCP1DEL_P1RSEN_MASK                     equ 0080h
ECCP1DEL_P1DC0_POSN                      equ 0000h
ECCP1DEL_P1DC0_POSITION                  equ 0000h
ECCP1DEL_P1DC0_SIZE                      equ 0001h
ECCP1DEL_P1DC0_LENGTH                    equ 0001h
ECCP1DEL_P1DC0_MASK                      equ 0001h
ECCP1DEL_P1DC1_POSN                      equ 0001h
ECCP1DEL_P1DC1_POSITION                  equ 0001h
ECCP1DEL_P1DC1_SIZE                      equ 0001h
ECCP1DEL_P1DC1_LENGTH                    equ 0001h
ECCP1DEL_P1DC1_MASK                      equ 0002h
ECCP1DEL_P1DC2_POSN                      equ 0002h
ECCP1DEL_P1DC2_POSITION                  equ 0002h
ECCP1DEL_P1DC2_SIZE                      equ 0001h
ECCP1DEL_P1DC2_LENGTH                    equ 0001h
ECCP1DEL_P1DC2_MASK                      equ 0004h
ECCP1DEL_P1DC3_POSN                      equ 0003h
ECCP1DEL_P1DC3_POSITION                  equ 0003h
ECCP1DEL_P1DC3_SIZE                      equ 0001h
ECCP1DEL_P1DC3_LENGTH                    equ 0001h
ECCP1DEL_P1DC3_MASK                      equ 0008h
ECCP1DEL_P1DC4_POSN                      equ 0004h
ECCP1DEL_P1DC4_POSITION                  equ 0004h
ECCP1DEL_P1DC4_SIZE                      equ 0001h
ECCP1DEL_P1DC4_LENGTH                    equ 0001h
ECCP1DEL_P1DC4_MASK                      equ 0010h
ECCP1DEL_P1DC5_POSN                      equ 0005h
ECCP1DEL_P1DC5_POSITION                  equ 0005h
ECCP1DEL_P1DC5_SIZE                      equ 0001h
ECCP1DEL_P1DC5_LENGTH                    equ 0001h
ECCP1DEL_P1DC5_MASK                      equ 0020h
ECCP1DEL_P1DC6_POSN                      equ 0006h
ECCP1DEL_P1DC6_POSITION                  equ 0006h
ECCP1DEL_P1DC6_SIZE                      equ 0001h
ECCP1DEL_P1DC6_LENGTH                    equ 0001h
ECCP1DEL_P1DC6_MASK                      equ 0040h

